tests/assets/test_suites/w3c_wsdl20/messages/good/InOutComplexTypes-3G/canon-inout-complextypes-selftest.wsimsg

<?xml version="1.0" encoding="UTF-8"?>
<!-- https://dev.w3.org/2002/ws/desc/test-suite/messages/good/InOutComplexTypes-3G/canon-inout-complextypes-selftest.wsimsg -->
<!-- Copyright © 2008 - W3C, (MIT, ERCIM, Keio). All Rights Reserved. http://www.w3.org/Consortium/Legal/2002/copyright-documents-20021231 -->
<log timestamp="2006-07-06T10:46:04.519"
    xmlns="http://www.ws-i.org/testing/2004/07/log/"
    xmlns:wsi-monConfig="http://www.ws-i.org/testing/2004/07/monitorConfig/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <monitor version="1.0" releaseDate="2003-03-20">
    <implementer name="IBM" location=""/>
    <environment>
      <runtime name="Java(TM) 2 Runtime Environment, Standard Edition" version="1.5.0_06-b05"/>
      <operatingSystem name="Windows XP" version="5.1"/>
      <xmlParser name="Apache Xerces" version="Xerces-J 2.8.0"/>
    </environment>
    <wsi-monConfig:configuration>
    <wsi-monConfig:comment>Comment</wsi-monConfig:comment>
      <wsi-monConfig:logFile replace="true" location="URL">
      <wsi-monConfig:addStyleSheet href="null" type="null" />
    </wsi-monConfig:logFile>
      <wsi-monConfig:logDuration>600</wsi-monConfig:logDuration>
      <wsi-monConfig:cleanupTimeoutSeconds>3</wsi-monConfig:cleanupTimeoutSeconds>
      <wsi-monConfig:manInTheMiddle>
      </wsi-monConfig:manInTheMiddle>
    </wsi-monConfig:configuration>
  </monitor>

<messageEntry xsi:type="httpMessageEntry" ID="1" conversationID="1" type="request" timestamp="2006-07-06T10:44:56.932Z">
<messageContent>&lt;?xml version=&quot;1.0&quot;?&gt;&lt;env:Envelope xmlns:env=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;env:Body&gt;&lt;ns1:echoStringParam xmlns:ns1=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;echo string&lt;/ns1:echoStringParam&gt;&lt;/env:Body&gt;&lt;/env:Envelope&gt;</messageContent>
<senderHostAndPort>KERGUELEN:1355</senderHostAndPort>
<receiverHostAndPort>youenn.dyndns.ws:80</receiverHostAndPort>
<httpHeaders>POST /wss/echoAxis2 HTTP/1.1&#xd;
Host: youenn.dyndns.ws&#xd;
Pragma: no-cache&#xd;
Accept: */*&#xd;
SOAPAction: &quot;echoString&quot;&#xd;
Content-Type: text/xml&#xd;
Content-Length: 229&#xd;
&#xd;
</httpHeaders>
</messageEntry>
<messageEntry xsi:type="httpMessageEntry" ID="2" conversationID="1" type="response" timestamp="2006-07-06T10:44:57.112Z">
<messageContent>&lt;?xml version=&quot;1.0&quot;?&gt;&lt;env:Envelope xmlns:env=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;env:Body&gt;&lt;ns1:echoStringReturn xmlns:ns1=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;echo string&lt;/ns1:echoStringReturn&gt;&lt;/env:Body&gt;&lt;/env:Envelope&gt;</messageContent>
<senderHostAndPort>youenn.dyndns.ws:80</senderHostAndPort>
<receiverHostAndPort>KERGUELEN:1355</receiverHostAndPort>
<httpHeaders>HTTP/1.1 200 OK&#xd;
Date: Thu, 06 Jul 2006 14:44:50 GMT&#xd;
Server: Apache/2.0.50 (Win32)&#xd;
Content-Length: 231&#xd;
Content-Type: text/xml&#xd;
&#xd;
</httpHeaders>
</messageEntry>
<messageEntry xsi:type="httpMessageEntry" ID="3" conversationID="2" type="request" timestamp="2006-07-06T10:45:00.347Z">
<messageContent>&lt;?xml version=&quot;1.0&quot;?&gt;&lt;env:Envelope xmlns:env=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;env:Body&gt;&lt;ns1:echoStringArrayParam xmlns:ns1=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;&lt;ns1:string&gt;one&lt;/ns1:string&gt;&lt;ns1:string&gt;two&lt;/ns1:string&gt;&lt;ns1:string&gt;three&lt;/ns1:string&gt;&lt;/ns1:echoStringArrayParam&gt;&lt;/env:Body&gt;&lt;/env:Envelope&gt;</messageContent>
<senderHostAndPort>KERGUELEN:1356</senderHostAndPort>
<receiverHostAndPort>youenn.dyndns.ws:80</receiverHostAndPort>
<httpHeaders>POST /wss/echoAxis2 HTTP/1.1&#xd;
Host: youenn.dyndns.ws&#xd;
Pragma: no-cache&#xd;
Accept: */*&#xd;
SOAPAction: &quot;echoStringArray&quot;&#xd;
Content-Type: text/xml&#xd;
Content-Length: 314&#xd;
&#xd;
</httpHeaders>
</messageEntry>
<messageEntry xsi:type="httpMessageEntry" ID="4" conversationID="2" type="response" timestamp="2006-07-06T10:45:01.168Z">
<messageContent>&lt;?xml version=&quot;1.0&quot;?&gt;&lt;env:Envelope xmlns:env=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;env:Body&gt;&lt;ns1:echoStringArrayReturn xmlns:ns1=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;&lt;ns1:string&gt;one&lt;/ns1:string&gt;&lt;ns1:string&gt;two&lt;/ns1:string&gt;&lt;ns1:string&gt;three&lt;/ns1:string&gt;&lt;/ns1:echoStringArrayReturn&gt;&lt;/env:Body&gt;&lt;/env:Envelope&gt;</messageContent>
<senderHostAndPort>youenn.dyndns.ws:80</senderHostAndPort>
<receiverHostAndPort>KERGUELEN:1356</receiverHostAndPort>
<httpHeaders>HTTP/1.1 200 OK&#xd;
Date: Thu, 06 Jul 2006 14:44:53 GMT&#xd;
Server: Apache/2.0.50 (Win32)&#xd;
Content-Length: 316&#xd;
Content-Type: text/xml&#xd;
&#xd;
</httpHeaders>
</messageEntry>
<messageEntry xsi:type="httpMessageEntry" ID="5" conversationID="3" type="request" timestamp="2006-07-06T10:45:04.363Z">
<messageContent>&lt;?xml version=&quot;1.0&quot;?&gt;&lt;env:Envelope xmlns:env=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;env:Body&gt;&lt;ns1:echoStructParam xmlns:ns1=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;&lt;ns1:varFloat&gt;10.000000&lt;/ns1:varFloat&gt;&lt;ns1:varInt&gt;10&lt;/ns1:varInt&gt;&lt;ns1:varString&gt;echo string&lt;/ns1:varString&gt;&lt;/ns1:echoStructParam&gt;&lt;/env:Body&gt;&lt;/env:Envelope&gt;</messageContent>
<senderHostAndPort>KERGUELEN:1357</senderHostAndPort>
<receiverHostAndPort>youenn.dyndns.ws:80</receiverHostAndPort>
<httpHeaders>POST /wss/echoAxis2 HTTP/1.1&#xd;
Host: youenn.dyndns.ws&#xd;
Pragma: no-cache&#xd;
Accept: */*&#xd;
SOAPAction: &quot;echoStruct&quot;&#xd;
Content-Type: text/xml&#xd;
Content-Length: 325&#xd;
&#xd;
</httpHeaders>
</messageEntry>
<messageEntry xsi:type="httpMessageEntry" ID="6" conversationID="3" type="response" timestamp="2006-07-06T10:45:04.543Z">
<messageContent>&lt;?xml version=&quot;1.0&quot;?&gt;&lt;env:Envelope xmlns:env=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;env:Body&gt;&lt;ns1:echoStructReturn xmlns:ns1=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;&lt;ns1:varFloat&gt;10.000000&lt;/ns1:varFloat&gt;&lt;ns1:varInt&gt;10&lt;/ns1:varInt&gt;&lt;ns1:varString&gt;echo string&lt;/ns1:varString&gt;&lt;/ns1:echoStructReturn&gt;&lt;/env:Body&gt;&lt;/env:Envelope&gt;</messageContent>
<senderHostAndPort>youenn.dyndns.ws:80</senderHostAndPort>
<receiverHostAndPort>KERGUELEN:1357</receiverHostAndPort>
<httpHeaders>HTTP/1.1 200 OK&#xd;
Date: Thu, 06 Jul 2006 14:44:57 GMT&#xd;
Server: Apache/2.0.50 (Win32)&#xd;
Content-Length: 327&#xd;
Content-Type: text/xml&#xd;
&#xd;
</httpHeaders>
</messageEntry>
</log>
